app/Controllers/Api/Ujian.php

    public function getSoal($id_pengajuan) {
        $pengajuanModel = new PengajuanSertifikasiModel();
        $pengajuan = $pengajuanModel->find($id_pengajuan);
---
SELECT *
FROM `tabel_pengajuan_sertifikasi`
WHERE `tabel_pengajuan_sertifikasi`.`id` = '2'