app/Controllers/Api/User.php

    public function index() {
        $users = $this->model->findAll();
        $db = \Config\Database::connect();
        $perawatList = $db->table('tabel_perawat')->where('id_user IS NOT NULL')->get()->getResultArray();
---
SELECT *
FROM `tabel_perawat`
WHERE `id_user` IS NOT NULL